## **Reto de la semana**

Descarga el archivo de Excel de la siguiente liga, la cual deberás subir a tu Drive:https://docs.google.com/spreadsheets/d/1muHS297qH0BfsASI5thANRRy2-zjeODS/edit?usp=sharing&ouid=109463671594466264489&rtpof=true&sd=true

El reto consta de dos partes:

1. Genera un **data frame** llamado `reto` (¡no olvides importar `Pandas` y `Numpy`!) y observa su composición con la función `.head` o `.tail`.
2. Haz, por lo menos, dos **groupby** usando la información del **data frame** `reto`. Puedes experimentar tomando diferentes valores.

In [3]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('/Users/andreblass/Documents/Python/Ucamp/semana2/tarjetasdecredito.xlsx - data.csv')

In [5]:
df.head()

   id first_name  last_name  age credit_card        city
0   1      Megan     Osmund   55        visa     Huachos
1   2    Calhoun     Debney   51  mastercard     Hashaat
2   3  Millicent    Buckles   28        visa  Nagbacalan
3   4    Hartley  Petticrew   39  mastercard   La Virgen
4   5     Cynthy   Laurenzi   51  mastercard   Combapata

In [8]:
df.tail()

       id first_name    last_name  age credit_card            city
995   996   Patricia    Broinlich   50  mastercard  Novyy Starodub
996   997    Trumann    Cloughton   51        visa          Dhahab
997   998       Eben  Bickerdicke   21        visa    Khawr Maksar
998   999     Isador      Larcier   41  mastercard      Charleston
999  1000    Katrine      Parrott   25        visa        Enköping

In [11]:
df.groupby(by= 'age')['city'].min()

age
20              Bakung
21           Ankazoabo
22             Agrínio
23              Abadou
24         Ampelókipoi
25              Aemura
26      Alcácer do Sal
27              Acaraú
28             Airmata
29              Bobowo
30        Anse Boileau
31          Almafuerte
32               Abaza
33             Batelov
34           Ad Dujayl
35              Amerta
36              Arauco
37               Abang
38         Ar Rudayyif
39             Altares
40          Al Ḩarajah
41    's-Hertogenbosch
42               Aktau
43            Chmielno
44           Angoulême
45             Añatuya
46             Alkmaar
47         Al Qamşīyah
48             Boljoon
49            Ardirejo
50               Banos
51            Alvarães
52              Abaeté
53             Arsenal
54               Agogo
55                Aksu
Name: city, dtype: object